; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v3)
             (pred_6 ?v10 ?v13)
             (pred_12 ?v11 ?v13)
             (pred_7 ?v6 ?v11 )
	     (pred_4 ?v11)
             (pred_10 ?v2)
             (pred_2 ?v10)
             (pred_3 ?v13)
             (pred_5 ?v11)
             (pred_8 ?v10)
             (pred_9 ?v11)
             (pred_11 ))



(:action op_5
:parameters (?v4 ?v5 ?v8 ?v9)
:precondition (and (pred_10 ?v4) (pred_10 ?v5) (pred_2 ?v8) (pred_3 ?v9)
          (pred_1 ?v4 ?v5) (pred_6 ?v8 ?v9)
                   (pred_12 ?v5 ?v9) (pred_4 ?v4) 
                   (pred_5 ?v5) (pred_8 ?v8))
:effect (and  (pred_9 ?v5) (not (pred_5 ?v5))))


(:action op_3
:parameters (?v4 ?v12)
:precondition (and (pred_10 ?v4) (pred_10 ?v12)
               (pred_4 ?v4) (pred_1 ?v4 ?v12) (pred_9 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v4))))

(:action op_2
:parameters (?v4 ?v8)
:precondition (and (pred_10 ?v4) (pred_2 ?v8) 
                  (pred_4 ?v4) (pred_7 ?v8 ?v4) (pred_11 ))
:effect (and (pred_8 ?v8)
   (not (pred_7 ?v8 ?v4)) (not (pred_11 ))))


(:action op_1
:parameters (?v4 ?v1 ?v7)
:precondition (and (pred_10 ?v4) (pred_2 ?v1) (pred_2 ?v7)
                  (pred_4 ?v4) (pred_8 ?v7) (pred_7 ?v1 ?v4))
:effect (and (pred_8 ?v1) (pred_7 ?v7 ?v4)
        (not (pred_8 ?v7)) (not (pred_7 ?v1 ?v4))))

(:action op_4
:parameters (?v4 ?v8)
:precondition (and (pred_10 ?v4) (pred_2 ?v8) 
                  (pred_4 ?v4) (pred_8 ?v8))
:effect (and (pred_11 ) (pred_7 ?v8 ?v4) (not (pred_8 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_20 obj_03 obj_09 obj_01 obj_04 obj_06 obj_12 obj_11 obj_22 obj_16 obj_15 obj_02 obj_07 obj_08 obj_18
    obj_10 obj_13 obj_21
    obj_05 obj_14 obj_17
    )

    (:init
       (pred_11)

       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_21)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_17)

       (pred_1 obj_19 obj_01)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_19)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_19)
       (pred_1 obj_04 obj_22)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_22 obj_07)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_04)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_16 obj_08)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_22)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_16)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_18 obj_08)
       (pred_5 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_12  obj_01 obj_10)
       (pred_12  obj_18 obj_13)
       (pred_12  obj_04 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_03)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_02)
       (pred_9 obj_07)
       (pred_9 obj_08)

       (pred_6  obj_05 obj_10)
       (pred_6  obj_14 obj_13)
       (pred_6  obj_17 obj_21)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_17 obj_02)
       (pred_4 obj_16)
    )

    (:goal (and
       (pred_7 obj_05 obj_02)
       (pred_7 obj_14 obj_20)
    ))
(:constraints
  (always (not (pred_4 obj_06)))
)
)

; plan
1. (op_2 obj_16 obj_05)
   deleted: (pred_7 obj_05 obj_16) (pred_11)
   added: (pred_8 obj_05)
   goals met: 0 of 2
2. (op_3 obj_16 obj_22)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_22)
   goals met: 0 of 2
3. (op_3 obj_22 obj_11)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_11)
   goals met: 0 of 2
4. (op_5 obj_11 obj_01 obj_05 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_9 obj_01)
   goals met: 0 of 2
5. (op_3 obj_11 obj_02)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_02)
   goals met: 0 of 2
6. (op_4 obj_02 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_11) (pred_7 obj_05 obj_02)
   goals met: 1 of 2
7. (op_3 obj_02 obj_11)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_11)
   goals met: 1 of 2
8. (op_3 obj_11 obj_01)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_01)
   goals met: 1 of 2
9. (op_3 obj_01 obj_19)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_19)
   goals met: 1 of 2
10. (op_3 obj_19 obj_20)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_20)
   goals met: 1 of 2
11. (op_3 obj_20 obj_03)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_03)
   goals met: 1 of 2
12. (op_3 obj_03 obj_09)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_09)
   goals met: 1 of 2
13. (op_2 obj_09 obj_14)
   deleted: (pred_7 obj_14 obj_09) (pred_11)
   added: (pred_8 obj_14)
   goals met: 1 of 2
14. (op_3 obj_09 obj_03)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_03)
   goals met: 1 of 2
15. (op_3 obj_03 obj_20)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_20)
   goals met: 1 of 2
16. (op_4 obj_20 obj_14)
   deleted: (pred_8 obj_14)
   added: (pred_11) (pred_7 obj_14 obj_20)
   goals met: 2 of 2
